Revit 2026 API

# TemperatureRatingTypeAddWireSize Method

---

Add a new kind of wire size type into this temperature rating type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WireSize AddWireSize(
	string size,
	long ampacity,
	double diameter
)
```
```vb
Public Function AddWireSize (
	size As String,
	ampacity As Long,
	diameter As Double
) As WireSize
```
```cpp
public:
WireSize^ AddWireSize(
	String^ size,
	long long ampacity,
	double diameter
)
```
```fsharp
member AddWireSize :
        size : string *
        ampacity : int64 *
        diameter : float -> WireSize
```

#### Parameters

size String
    Size of wire size.
ampacity Int64
    Ampacity of wire size to be added.
diameter Double
    Diameter of wire size to be added.

#### Return Value

WireSizeConstructed wire size type.

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace